Revit 2024 API
ExportLayerInfo.CutLayerName Property
 The cut layer name stored in value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public string CutLayerName { get; set; }
Visual Basic
Public Property CutLayerName As String
	Get
	Set
Visual C++
public:
property String^ CutLayerName {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace